**Базовые запросы SQL**

Выведите все записи из таблицы products.

In [ ]:
SELECT *
FROM   
	products

Выведите все записи из таблицы products, отсортировав их по наименованиям товаров в алфавитном порядке, т.е. по возрастанию. Для сортировки используйте оператор ORDER BY.

In [ ]:
SELECT *
FROM   
	products
ORDER BY 
	name ASC

Отсортируйте таблицу courier_actions сначала по колонке courier_id по возрастанию id курьера, потом по колонке action (снова по возрастанию), а затем по колонке time, но уже по убыванию — от самого последнего действия к самому первому. Не забудьте включить в результат колонку order_id. 
Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

In [ ]:
SELECT *
FROM   
	courier_actions
ORDER BY 
	courier_id ASC, 
	action ASC, 
	time DESC 
LIMIT 
	1000

Используя операторы SELECT, FROM, ORDER BY и LIMIT, определите 5 самых дорогих товаров в таблице products, которые доставляет наш сервис. Выведите их наименования и цену.

In [ ]:
SELECT 
	name,
    price
FROM   
	products
ORDER BY 
	price DESC
LIMIT
	5

Как в прошлом задании определите 5 самых дорогих товаров в таблице products. Но теперь колонки name и price переименуйте соответственно в product_name и product_price.

In [ ]:
SELECT 
	name AS product_name,
    price AS product_price
FROM   
	products
ORDER BY 
	price DESC 
LIMIT 
	5

Используя операторы SELECT, FROM, ORDER BY и LIMIT, а также функцию LENGTH, определите товар с самым длинным названием в таблице products. Выведите его наименование, длину наименования в символах, а также цену этого товара.

In [ ]:
SELECT 
	name,
    price,
    LENGTH(name) AS name_length
FROM   
	products
ORDER BY 
	name_length DESC 
LIMIT
	1

Примените последовательно функции UPPER и SPLIT_PART к колонке name и преобразуйте наименования товаров в таблице products так, чтобы от названий осталось только первое слово, записанное в верхнем регистре. Колонку с новым названием, состоящим из первого слова, назовите first_word.

In [ ]:
SELECT 
	name,
    UPPER(SPLIT_PART(name, ' ', 1)) AS first_word,
	price
FROM   
	products
ORDER BY 
	name ASC

Измените тип колонки price из таблицы products на VARCHAR. Выведите колонки с наименованием товаров, ценой в исходном формате и ценой в формате VARCHAR. Новую колонку с ценой в новом формате назовите price_char.
Результат отсортируйте по возрастанию исходного наименования товара в колонке name. Количество выводимых записей не ограничивайте.

In [ ]:
SELECT 
	name,
    price,
    CAST(price AS VARCHAR) AS price_char
FROM  
	products
ORDER BY 
	name ASC

Для первых 200 записей из таблицы orders выведите информацию в следующем виде (обратите внимание на пробелы): 
Заказ № [id заказа] создан [дата]

In [ ]:
SELECT 
	CONCAT('Заказ № ', order_id, ' создан ', creation_time::DATE) AS order_info
FROM   
	orders
LIMIT
	200

Выведите id всех курьеров и их годы рождения из таблицы couriers.
Год рождения необходимо получить из колонки birth_date. Новую колонку с годом назовите birth_year. Результат отсортируйте сначала по убыванию года рождения курьера (т.е. от самых младших к самым старшим), затем по возрастанию id курьера.

In [ ]:
SELECT 
	courier_id,
    DATE_PART('year', birth_date) AS birth_year
FROM   
	couriers
ORDER BY 
	birth_year DESC, 
	courier_id ASC

Как и в предыдущем задании, снова выведите id всех курьеров и их годы рождения, только теперь к извлеченному году примените функцию COALESCE. Укажите параметры функции так, чтобы вместо NULL значений в результат попадало текстовое значение unknown. Названия полей оставьте прежними.
Отсортируйте итоговую таблицу сначала по убыванию года рождения курьера, затем по возрастанию id курьера.

In [ ]:
SELECT 
	courier_id,
    COALESCE(DATE_PART('year', birth_date)::VARCHAR, 'unknown') AS birth_year
FROM   
	couriers
ORDER BY 
	birth_year DESC, 
	courier_id

Давайте представим, что по какой-то необъяснимой причине мы вдруг решили в одночасье повысить цену всех товаров в таблице products на 5%.
Выведите id и наименования всех товаров, их старую и новую цену. Колонку со старой ценой назовите old_price, а колонку с новой — new_price.
Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

In [ ]:
SELECT 
	product_id,
    name,
    price AS old_price,
    price * 1.05 AS new_price
FROM   
	products
ORDER BY 
	new_price DESC,
	product_id

Вновь, как и в прошлом задании, повысьте цену всех товаров на 5%, только теперь к колонке с новой ценой примените функцию ROUND. Выведите id и наименования товаров, их старую цену, а также новую цену с округлением. Новую цену округлите до одного знака после запятой, но тип данных не меняйте.
Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

In [ ]:
SELECT 
	product_id,
    name,
    price AS old_price,
    ROuND(price * 1.05, 1) AS new_price
FROM   
	products
ORDER BY 
	new_price DESC,
	product_id

Повысьте цену на 5% только на те товары, цена которых превышает 100 рублей. Цену остальных товаров оставьте без изменений. Также не повышайте цену на икру, которая и так стоит 800 рублей. Выведите id и наименования всех товаров, их старую и новую цену. Цену округлять не нужно.
Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

In [ ]:
SELECT 
	product_id,
    name,
    price AS old_price,
    CASE
		WHEN price > 100 AND NOT (name = 'икра' AND price = 800) THEN price * 1.05
    	ELSE price 
	END AS new_price
FROM   
	products
ORDER BY 
	new_price DESC,
	product_id ASC

Вычислите НДС каждого товара в таблице products и рассчитайте цену без учёта НДС. Выведите всю информацию о товарах, включая сумму налога и цену без его учёта. Колонки с суммой налога и ценой без НДС назовите соответственно tax и price_before_tax. Округлите значения в этих колонках до двух знаков после запятой.
Результат отсортируйте сначала по убыванию цены товара без учёта НДС, затем по возрастанию id товара.

In [ ]:
SELECT 
	product_id,
    name,
	price,
    ROUND(((price / 120) * 20), 2) AS tax,
    ROUND(price - ((price / 120) * 20), 2) AS price_before_tax
FROM  
	products
ORDER BY 
	price_before_tax DESC,
	product_id